Backend/app/controllers/api/friendships_controller.rb

INSERT INTO "friendships" ("user_id", "friend_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["friend_id", 2], ["created_at", "2015-12-16 10:26:09.207871"], ["updated_at", "2015-12-16 10:26:09.207871"]]
---
  def follow
    user_id = params[:id]
    friend_id = params[:friend_id]

    @following = Friendship.new(user_id: user_id, friend_id: friend_id)

    if @following.save

SELECT "friendships".* FROM "friendships" WHERE "friendships"."user_id" = 1
---
  def followList
    user_id = params[:id]
    @followers = Friendship.where(user: user_id).to_json(:include => :friend)