Backend/app/controllers/api/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", nil]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
  def show
    @post = Post.find(params[:id]).to_json(:include => [:user, :comments])

INSERT INTO "posts" ("text", "post_type", "user_id", "location", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["text", "WOW OMG THIS IS AMAZING"], ["post_type", 1], ["user_id", 1], ["location", "Pronto"], ["created_at", "2015-12-15 18:49:06.742564"], ["updated_at", "2015-12-15 18:49:06.742564"]]
---
  def create
    @post = Post.new(text: params[:text], post_type: params[:post_type], user_id: params[:user_id], location: params[:location])
      if @post.save