Backend/app/controllers/api/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "date_of_birth", "email", "password_digest", "city", "country", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(first_name: params[:first_name], last_name: params[:last_name], date_of_birth: params[:date_of_birth],
    email: params[:email], password: params[:password], city: params[:city],
    country: params[:country], image: params[:image])
      if @user.save